In [7]:
pip install pandas

Requirement already satisfied: pandas in c:\users\my-pc\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\my-pc\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\my-pc\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\my-pc\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\my-pc\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (1.25.2)
Requirement already satisfied: six>=1.5 in c:\users\my-pc\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.2.1
[notice] To update, run: C:\Users\My-PC\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [5]:
import pandas as pd
import numpy as np

In [6]:
pd.Series(['A','B','C'])

0    A
1    B
2    C
dtype: object

In [8]:
df = pd.DataFrame({
   "Name": ["Alice", "Bob", "Charlie"],
   "Age": [25, 32, 22]
})
print(df)

      Name  Age
0    Alice   25
1      Bob   32
2  Charlie   22

In [10]:
fruits=pd.DataFrame({
    "series":[20,30,15,25],
    "index":['apples','bananas','cherries','Dates'] 
})
print(fruits)

   series     index
0      20    apples
1      30   bananas
2      15  cherries
3      25     Dates

In [11]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 32, 22, 35, 47],
    "Score": [85, 63, 77, 96, 54]
})

In [12]:
print(df.describe())

             Age      Score
count   5.000000   5.000000
mean   32.200000  75.000000
std     9.782638  16.807736
min    22.000000  54.000000
25%    25.000000  63.000000
50%    32.000000  77.000000
75%    35.000000  85.000000
max    47.000000  96.000000

In [13]:
df['Grade'] = ['A', 'B', 'C', 'A', 'F']
df

      Name  Age  Score Grade
0    Alice   25     85     A
1      Bob   32     63     B
2  Charlie   22     77     C
3    David   35     96     A
4      Eve   47     54     F

In [14]:
df['Double_Age'] = df['Age'] * 2

In [15]:
df

      Name  Age  Score Grade  Double_Age
0    Alice   25     85     A          50
1      Bob   32     63     B          64
2  Charlie   22     77     C          44
3    David   35     96     A          70
4      Eve   47     54     F          94

In [16]:
series = pd.Series([1, 2, 3, 4])
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [17]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 32, 22, 35, 47],
    "Score": [85, 63, 77, 96, 54]
})
print(df.head(3))

      Name  Age  Score
0    Alice   25     85
1      Bob   32     63
2  Charlie   22     77

In [18]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Score   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes
None

In [19]:
print(df.loc[0])

Name     Alice
Age         25
Score       85
Name: 0, dtype: object

In [20]:
print(df.iloc[0])

Name     Alice
Age         25
Score       85
Name: 0, dtype: object

In [21]:
print(df.iloc[3])

Name     David
Age         35
Score       96
Name: 3, dtype: object

In [22]:
df['Grade'] = ['A', 'B', 'C', 'A', 'F']
df.rename(columns={'Name': 'StudentName'}, inplace=True)

In [23]:
df

  StudentName  Age  Score Grade
0       Alice   25     85     A
1         Bob   32     63     B
2     Charlie   22     77     C
3       David   35     96     A
4         Eve   47     54     F

In [24]:
df.drop('Grade', axis=1, inplace=True)
df

  StudentName  Age  Score
0       Alice   25     85
1         Bob   32     63
2     Charlie   22     77
3       David   35     96
4         Eve   47     54

In [25]:
print(df.isna())

   StudentName    Age  Score
0        False  False  False
1        False  False  False
2        False  False  False
3        False  False  False
4        False  False  False

In [26]:
df.fillna(value='NA', inplace=True)

In [27]:
df

  StudentName  Age  Score
0       Alice   25     85
1         Bob   32     63
2     Charlie   22     77
3       David   35     96
4         Eve   47     54

In [28]:
df['Age'] = df['Age'].astype('float')
df

  StudentName   Age  Score
0       Alice  25.0     85
1         Bob  32.0     63
2     Charlie  22.0     77
3       David  35.0     96
4         Eve  47.0     54

In [29]:
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)
means = df.mean()
print(means)

A    2.0
B    5.0
C    8.0
dtype: float64

In [30]:
print(df.min())

A    1
B    4
C    7
dtype: int64

In [31]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 32, 22, 35, 47],
    "Score": [85, 63, 77, 96, 54]
})
df['Quantity'].sum()

KeyError: 'Quantity'

In [32]:
print(df.nlargest(3, 'Score'))

      Name  Age  Score
3    David   35     96
0    Alice   25     85
2  Charlie   22     77

In [33]:
age_sum = df['Age'].sum()
print("Сумма возрастов:", age_sum)

Сумма возрастов: 161